// let 기상시간 = 7;
// let 출근시간 = "";

// if (기상시간 >= 10) {
//   출근시간 = "윤형근법위반 커피 쏴";
// } else {
//   if (기상시간 == 9) {
//     출근시간 = "아슬아슬한데?";
//   } else {
//     출근시간 = "여유있게출발";
//   }
// }

// console.log(출근시간);

// let 팀순위 = 1;
// let 가을야구갈수있을까 = "";

// if (팀순위 == 1) {
//   가을야구갈수있을까 = "한국시리즈로 직행하세여~";
// } else {
//   if (팀순위 <= 5) {
//     가을야구갈수있을까 = "가을야구 축하드립니다!";
//   } else 가을야구갈수있을까 = "으이구 너희가 야구팀이냐?";
// }

// console.log(가을야구갈수있을까);

let 시간 = 7;
let 시간2 = "";

if (시간 < 5) {
  시간2 = "작습니다";
} else {
  if (시간 < 10) {
    시간2 = "중간입니다";
  } else 시간2 = "큰수입니다";
}
console.log(시간2);
