// function 인사하기() {
//     console.log("안녕하세요!");
//   }

//   // 함수 호출
//   인사하기();
//   인사하기();
//   인사하기();
//   인사하기();

// function 인사() {
//   console.log("안녕하세요? 반갑습니다!");
// }

// 인사();

//   function 숫자더하기(첫번째숫자, 두번째숫자) {
//     return 첫번째숫자 + 두번째숫자;
//   }

//   // 함수 호출
//   let 결과1 = 숫자더하기(3, 5);
//   console.log(결과1);  // 출력: 8

//   let 결과2 = 숫자더하기(10, 20);
//   console.log(결과2);  // 출력: 30

//   let 결과3 = 숫자더하기(-1, 1);
//   console.log(결과3);  // 출력: 0

//   let 결과4 = 숫자더하기(7, 8);
//   console.log(결과4);  // 출력: 15

// function 곱하기(숫자1, 숫자2) {
//   return 숫자1 * 숫자2;
// }

// let 결과1 = 곱하기(4, 5);
// console.log(결과1);

// let 결과2 = 곱하기(1787218, 2830890);
// console.log(결과2);

// function 문자열합치기(문자열A, 문자열B) {
//   return 문자열A + 문자열B;
// }

// let 문자열예시1 = 문자열합치기("안녕", "하세요");
// console.log(문자열예시1);

// let 문자열예시2 = 문자열합치기("저는", " 함수의 재미를 느끼는중입니다");
// console.log(문자열예시2);

// let 문자열예시3 = 문자열합치기("그렇지만", "쉽지는않네요");
// console.log(문자열예시3);

// function 배열요소출력(배열) {
//   for (i = 0; i < 배열.length; i++) {
//     console.log(배열[i]);
//   }
// }

// // 함수 호출
// let 과일들1 = ["사과", "바나나", "포도"];
// 배열요소출력(과일들1);

// let 과일들2 = ["딸기", "키위", "수박"];
// 배열요소출력(과일들2);

// let 과일들3 = ["오렌지", "망고", "파인애플"];
// 배열요소출력(과일들3);

// let 과일들4 = ["복숭아", "자두", "체리"];
// 배열요소출력(과일들4);

// 함수예시
// 1 배열에 특정 수 곱하기
// 2 배열에서 짝수 출력하기
// 3 배열에서 무작위 값 추출하기
// 0 함수 기본 곱하기 다섯번 적고 출력하기

// // 함수구조복습 1
// function 복습1(숫자1, 숫자2) {
//   return 숫자1 * 숫자2;
// }

// let 복습결과1 = 복습1(5, 7);
// console.log(복습결과1);

// // 함수구조복습 2
// function 복습2(숫자3, 숫자4) {
//   return 숫자3 + 숫자4;
// }

// let 복습결과2 = 복습2(300, 800);
// console.log(복습결과2);

// // 함수구조복습 3
// function 복습3(숫자4, 숫자1) {
//   return 숫자4 + 숫자1;
// }

// let 복습결과3 = 복습3(4, 6);
// console.log(복습결과3);

// // 함수구조복습 4

// function 복습4(숫자1, 숫자2) {
//   return 숫자1 / 숫자2;
// }

// let 복습결과4 = 복습4(10, 5);
// console.log(복습결과4);

// // 함수구조복습5
// function 복습5(숫자1, 숫자2) {
//   if (숫자1 > 숫자2) {
//     return 숫자1 - 숫자2;
//   } else {
//     return 숫자1 + 숫자2;
//   }
// }

// let 복습결과5 = 복습5(10, 5);
// console.log(복습결과5);
// let 복습결과6 = 복습5(6, 10);
// console.log(복습결과6);

// 함수구조복습6
// function 야구승률(팀1, 팀2, 팀3, 팀4) {
//   if (팀1 > (팀2, 팀3, 팀4)) {
//     return "정규리그 우승";
//   } else 팀1 < (팀2, 팀3, 팀4);
//   return "졌지만 잘싸웠다!";
// }

// let 치열한순위싸움결과 = 야구승률(0.153, 0.423, 0.321, 0.451);
// console.log(치열한순위싸움결과);

// else에 {} 씌우지 말자.
// 제발 저장 좀 하자

// 함수구조복습7

function 과일(과일들) {
  console.log(과일들.length);
}

let 개수 = ["사과", "딸기", "자두", "복숭아", "살구", "포도", "메론", "수박"];
과일(개수);

// 함수구조복습8

function 덧셈(a, b, c) {
  let sum = a + b + c;
  console.log("결과 : ", sum);
  return sum;
}

let 계산결과 = 덧셈(1, 2, 8);
// console.log(계산결과);

//  제발 저장좀하자

// 함수구조복습 9

function 뉴진스(멤버) {
  for (let i = 0; i < 멤버.length, i++; ) {
    console.log(멤버[i]);
  }
}

let 멤버들이름 = ("하니", "해린", "민지");
뉴진스(멤버들이름);

// 이건 반복문을 이해하고 다시 해보자. 실패!

// 오후시간에 반복문 ㄱㄱ
